import {
    // @ts-ignore
    __SECRET_INTERNALS_DO_NOT_USE_OR_YOU_WILL_BE_FIRED as __ความลับ_ภายใน_ห้าม_ไม่_ไม่_ใช้_หรือ_คุณ_จะ_ถูก_ไล่ออก,
    createPortal as สร้างทางเชื่อม,
    findDOMNode as หาโหนดรูปแบบวัตถุเอกสาร,
    // @ts-ignore
    flushSync as ล้่างพร้อมกัน,
    hydrate as ชุ่มชื้น,
    render as แสดงผล,
    unmountComponentAtNode as ยกเลิกการเชื่อต่อส่วนประกอบที่โหนด,
    unstable_batchedUpdates as อัพเดทเป็นชุดแบบไม่เสถียร์,
    // @ts-ignore
    unstable_createPortal as สร้างทางเชื่อมแบบไม่เสถียร์,
    unstable_renderSubtreeIntoContainer as แสดงต้นไม้ย่อยเข้าไปในภาชนะแบบไม่เสถียร์
} from 'react-dom'

export {
    __ความลับ_ภายใน_ห้าม_ไม่_ไม่_ใช้_หรือ_คุณ_จะ_ถูก_ไล่ออก,
    สร้างทางเชื่อม,
    หาโหนดรูปแบบวัตถุเอกสาร,
    ล้่างพร้อมกัน,
    ชุ่มชื้น,
    แสดงผล,
    ยกเลิกการเชื่อต่อส่วนประกอบที่โหนด,
    อัพเดทเป็นชุดแบบไม่เสถียร์,
    สร้างทางเชื่อมแบบไม่เสถียร์,
    แสดงต้นไม้ย่อยเข้าไปในภาชนะแบบไม่เสถียร์
}

export const รูปแบบวัตถุเอกสารตอบสนอง = {
    __ความลับ_ภายใน_ห้าม_ไม่_ไม่_ใช้_หรือ_คุณ_จะ_ถูก_ไล่ออก,
    สร้างทางเชื่อม,
    หาโหนดรูปแบบวัตถุเอกสาร,
    ล้่างพร้อมกัน,
    ชุ่มชื้น,
    แสดงผล,
    ยกเลิกการเชื่อต่อส่วนประกอบที่โหนด,
    อัพเดทเป็นชุดแบบไม่เสถียร์,
    สร้างทางเชื่อมแบบไม่เสถียร์,
    แสดงต้นไม้ย่อยเข้าไปในภาชนะแบบไม่เสถียร์
}

export default รูปแบบวัตถุเอกสารตอบสนอง